#include<iostream>
#include<string>
#include<vector>
#include<algorithm>
#include<cmath>

using namespace std;

int main() {
    // Task 1. Обчислення складних відсотків за депозитом
    double P; // Основна сума інвестиції
    double r; // річна процентна ставка (у десятковій формі, тобто 5% = 0,05)
    int n; // кількість нарахувань відсотків на рік
    int t; // час, на який гроші інвестуються, у роках
    double A = P * (pow( 1 + (r / n), (n * t) ) ); // Майбутня загальна сума інвестиції, включаючи відсотки
    // Введіть початкову суму, річну процентну ставку, частоту капіталізації та термін депозиту
    printf("Введіть початкову суму депозиту: ");
    scanf("%lf", &P);
    printf("Введіть річну відсоткову ставку (у десяткових частках): ");
    scanf("%lf", &r);
    printf("Введіть частоту капіталізації: ");
    scanf("%d", &n);
    printf("Введіть термін депозиту у роках: ");
    scanf("%d", &t);
    printf("Підсумкова сума на депозиті: %.2lf\n", A);
}